tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4221_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF4221_H_
#define _PIC18LF4221_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define C1N                           4
#define AN1                           5
#define PORTA_RA1                     6
#define C2N                           7
#define AN2                           8
#define C2P                           9
#define PORTA_RA2                     10
#define CVREF                         11
#define VREFM                         12
#define AN3                           13
#define PORTA_RA3                     14
#define VREFP                         15
#define C1P                           16
#define PORTA_RA4                     17
#define PORTA_C1OUT                   18
#define T0CKI                         19
#define PORTA_C2OUT                   20
#define AN4                           21
#define PORTA_RA5                     22
#define NOT_SS                        23
#define LVDIN                         24
#define nSS                           25
#define HLVDIN                        26
#define CLKO                          27
#define PORTA_RA6                     28
#define OSC2                          29
#define CLKI                          30
#define PORTA_RA7                     31
#define OSC1                          32
#define RJPU                          33
#define PORTB                         34
#define FLT0                          35
#define INT0                          36
#define PORTB_RB0                     37
#define AN12                          38
#define INT1                          39
#define PORTB_RB1                     40
#define AN10                          41
#define AN8                           42
#define INT2                          43
#define PORTB_RB2                     44
#define AN9                           45
#define PORTB_CCP2                    46
#define CCP2_PA2                      47
#define PORTB_RB3                     48
#define KBI0                          49
#define PORTB_RB4                     50
#define AN11                          51
#define PGM                           52
#define PORTB_RB5                     53
#define KBI1                          54
#define PGC                           55
#define PORTB_RB6                     56
#define KBI2                          57
#define PGD                           58
#define PORTB_RB7                     59
#define KBI3                          60
#define PORTC                         61
#define T13CKI                        62
#define T1CKI                         63
#define T1OSO                         64
#define PORTC_RC0                     65
#define PORTC_CCP2                    66
#define T1OSI                         67
#define PA2                           68
#define PORTC_RC1                     69
#define CCP1                          70
#define P1A                           71
#define PA1                           72
#define PORTC_RC2                     73
#define SCL                           74
#define SCK                           75
#define PORTC_RC3                     76
#define SDA                           77
#define SDI                           78
#define PORTC_RC4                     79
#define SDO                           80
#define PORTC_RC5                     81
#define TX                            82
#define CK                            83
#define PORTC_RC6                     84
#define DT                            85
#define RX                            86
#define PORTC_RC7                     87
#define PORTD                         88
#define PSP0                          89
#define PORTD_RD0                     90
#define PSP1                          91
#define PORTD_RD1                     92
#define PSP2                          93
#define PORTD_RD2                     94
#define PSP3                          95
#define PORTD_RD3                     96
#define PSP4                          97
#define PORTD_RD4                     98
#define PSP5                          99
#define P1B                           100
#define PORTD_RD5                     101
#define PSP6                          102
#define P1C                           103
#define PORTD_RD6                     104
#define SS2                           105
#define PSP7                          106
#define P1D                           107
#define PORTD_RD7                     108
#define PORTE                         109
#define NOT_RD                        110
#define nRD                           111
#define AN5                           112
#define PORTE_RD                      113
#define PD2                           114
#define RDE                           115
#define PORTE_RE0                     116
#define AN6                           117
#define WRE                           118
#define PORTE_WR                      119
#define NOT_WR                        120
#define nWR                           121
#define PORTE_RE1                     122
#define PC2                           123
#define nCS                           124
#define NOT_CS                        125
#define AN7                           126
#define CCP10                         127
#define PB2                           128
#define CS                            129
#define PORTE_RE2                     130
#define VPP                           131
#define CCP9E                         132
#define PORTE_RE3                     133
#define NOT_MCLR                      134
#define MCLR                          135
#define nMCLR                         136
#define PC3E                          137
#define LATA                          138
#define LATA0                         139
#define LA0                           140
#define LATA1                         141
#define LA1                           142
#define LATA2                         143
#define LA2                           144
#define LATA3                         145
#define LA3                           146
#define LATA4                         147
#define LA4                           148
#define LATA5                         149
#define LA5                           150
#define LATA6                         151
#define LA6                           152
#define LATA7                         153
#define LA7                           154
#define LATB                          155
#define LB0                           156
#define LATB0                         157
#define LB1                           158
#define LATB1                         159
#define LB2                           160
#define LATB2                         161
#define LB3                           162
#define LATB3                         163
#define LB4                           164
#define LATB4                         165
#define LB5                           166
#define LATB5                         167
#define LB6                           168
#define LATB6                         169
#define LB7                           170
#define LATB7                         171
#define LATC                          172
#define LATC0                         173
#define LC0                           174
#define LATC1                         175
#define LC1                           176
#define LATC2                         177
#define LC2                           178
#define LATC3                         179
#define LC3                           180
#define LATC4                         181
#define LC4                           182
#define LATC5                         183
#define LC5                           184
#define LATC6                         185
#define LC6                           186
#define LATC7                         187
#define LC7                           188
#define LATD                          189
#define LATD0                         190
#define LD0                           191
#define LATD1                         192
#define LD1                           193
#define LATD2                         194
#define LD2                           195
#define LATD3                         196
#define LD3                           197
#define LATD4                         198
#define LD4                           199
#define LATD5                         200
#define LD5                           201
#define LATD6                         202
#define LD6                           203
#define LATD7                         204
#define LD7                           205
#define LATE                          206
#define LATE0                         207
#define LE0                           208
#define LATE1                         209
#define LE1                           210
#define LATE2                         211
#define LE2                           212
#define TRISA                         213
#define TRISA0                        214
#define TRISA_RA0                     215
#define TRISA1                        216
#define TRISA_RA1                     217
#define TRISA2                        218
#define TRISA_RA2                     219
#define TRISA3                        220
#define TRISA_RA3                     221
#define TRISA_RA4                     222
#define TRISA4                        223
#define TRISA_RA5                     224
#define TRISA5                        225
#define TRISA_RA6                     226
#define TRISA6                        227
#define TRISA_RA7                     228
#define TRISA7                        229
#define TRISB                         230
#define TRISB_RB0                     231
#define TRISB0                        232
#define TRISB_RB1                     233
#define TRISB1                        234
#define TRISB_RB2                     235
#define TRISB2                        236
#define TRISB_RB3                     237
#define TRISB3                        238
#define TRISB_RB4                     239
#define TRISB4                        240
#define TRISB_RB5                     241
#define TRISB5                        242
#define TRISB_RB6                     243
#define TRISB6                        244
#define TRISB_RB7                     245
#define TRISB7                        246
#define TRISC                         247
#define TRISC0                        248
#define TRISC_RC0                     249
#define TRISC1                        250
#define TRISC_RC1                     251
#define TRISC2                        252
#define TRISC_RC2                     253
#define TRISC3                        254
#define TRISC_RC3                     255
#define TRISC4                        256
#define TRISC_RC4                     257
#define TRISC5                        258
#define TRISC_RC5                     259
#define TRISC6                        260
#define TRISC_RC6                     261
#define TRISC7                        262
#define TRISC_RC7                     263
#define TRISD                         264
#define TRISD_RD0                     265
#define TRISD0                        266
#define TRISD_RD1                     267
#define TRISD1                        268
#define TRISD_RD2                     269
#define TRISD2                        270
#define TRISD_RD3                     271
#define TRISD3                        272
#define TRISD_RD4                     273
#define TRISD4                        274
#define TRISD_RD5                     275
#define TRISD5                        276
#define TRISD_RD6                     277
#define TRISD6                        278
#define TRISD_RD7                     279
#define TRISD7                        280
#define TRISE                         281
#define TRISE_RE0                     282
#define TRISE0                        283
#define TRISE_RE1                     284
#define TRISE1                        285
#define TRISE_RE2                     286
#define TRISE2                        287
#define TRISE_RE3                     288
#define PSPMODE                       289
#define IBOV                          290
#define OBF                           291
#define IBF                           292
#define OSCTUNE                       293
#define TUN0                          294
#define TUN                           295
#define TUN1                          296
#define TUN2                          297
#define TUN3                          298
#define TUN4                          299
#define PLLEN                         300
#define INTSRC                        301
#define PIE1                          302
#define TMR1IE                        303
#define TMR2IE                        304
#define CCP1IE                        305
#define SSPIE                         306
#define TXIE                          307
#define TX1IE                         308
#define RCIE                          309
#define RC1IE                         310
#define ADIE                          311
#define PSPIE                         312
#define PIR1                          313
#define TMR1IF                        314
#define TMR2IF                        315
#define CCP1IF                        316
#define SSPIF                         317
#define TXIF                          318
#define TX1IF                         319
#define RCIF                          320
#define RC1IF                         321
#define ADIF                          322
#define PSPIF                         323
#define IPR1                          324
#define TMR1IP                        325
#define TMR2IP                        326
#define CCP1IP                        327
#define SSPIP                         328
#define TX1IP                         329
#define TXIP                          330
#define RC1IP                         331
#define RCIP                          332
#define ADIP                          333
#define PSPIP                         334
#define PIE2                          335
#define CCP2IE                        336
#define TMR3IE                        337
#define HLVDIE                        338
#define LVDIE                         339
#define BCLIE                         340
#define EEIE                          341
#define CMIE                          342
#define OSCFIE                        343
#define PIR2                          344
#define CCP2IF                        345
#define TMR3IF                        346
#define HLVDIF                        347
#define LVDIF                         348
#define BCLIF                         349
#define EEIF                          350
#define CMIF                          351
#define OSCFIF                        352
#define IPR2                          353
#define CCP2IP                        354
#define TMR3IP                        355
#define HLVDIP                        356
#define LVDIP                         357
#define BCLIP                         358
#define EEIP                          359
#define CMIP                          360
#define OSCFIP                        361
#define EECON1                        362
#define EECON1_RD                     363
#define EECON1_WR                     364
#define WREN                          365
#define WRERR                         366
#define FREE                          367
#define CFGS                          368
#define EEFS                          369
#define EEPGD                         370
#define RCSTA                         371
#define RCD8                          372
#define RX9D                          373
#define OERR                          374
#define FERR                          375
#define ADDEN                         376
#define ADEN                          377
#define CREN                          378
#define SRENA                         379
#define SREN                          380
#define RC9                           381
#define RC8_9                         382
#define RX9                           383
#define SPEN                          384
#define TXSTA                         385
#define TXD8                          386
#define TX9D1                         387
#define TX9D                          388
#define TRMT                          389
#define TRMT1                         390
#define BRGH1                         391
#define BRGH                          392
#define SENDB1                        393
#define SENDB                         394
#define SYNC                          395
#define SYNC1                         396
#define TXEN1                         397
#define TXEN                          398
#define TX91                          399
#define TX8_9                         400
#define TX9                           401
#define CSRC1                         402
#define CSRC                          403
#define T3CON                         404
#define TMR3ON                        405
#define TMR3CS                        406
#define nT3SYNC                       407
#define NOT_T3SYNC                    408
#define T3SYNC                        409
#define SOSCEN3                       410
#define T3CCP1                        411
#define T3CKPS                        412
#define T3CKPS0                       413
#define T3CKPS1                       414
#define T3CCP2                        415
#define T3CON_RD16                    416
#define RD163                         417
#define T3RD16                        418
#define CMCON                         419
#define CM                            420
#define CMEN0                         421
#define CM0                           422
#define CMEN1                         423
#define CM1                           424
#define CMEN2                         425
#define CM2                           426
#define CIS                           427
#define C1INV                         428
#define C2INV                         429
#define CMCON_C1OUT                   430
#define CMCON_C2OUT                   431
#define CVRCON                        432
#define CVR                           433
#define CVR0                          434
#define CVR1                          435
#define CVR2                          436
#define CVR3                          437
#define CVRSS                         438
#define CVRR                          439
#define CVROEN                        440
#define CVROE                         441
#define CVREN                         442
#define ECCP1AS                       443
#define PSSBD                         444
#define PSSBD0                        445
#define PSSBD1                        446
#define PSSAC                         447
#define PSSAC0                        448
#define PSSAC1                        449
#define ECCPAS0                       450
#define ECCPAS                        451
#define ECCPAS1                       452
#define ECCPAS2                       453
#define ECCPASE                       454
#define ECCP1DEL                      455
#define PDC0                          456
#define PDC                           457
#define PDC1                          458
#define PDC2                          459
#define PDC3                          460
#define PDC4                          461
#define PDC5                          462
#define PDC6                          463
#define PRSEN                         464
#define BAUDCON                       465
#define ABDEN                         466
#define W4E                           467
#define WUE                           468
#define BRG16                         469
#define TXCKP                         470
#define SCKP                          471
#define RXCKP                         472
#define RXDTP                         473
#define RCMT                          474
#define RCIDL                         475
#define ABDOVF                        476
#define CCP2CON                       477
#define CCP2M                         478
#define CCP2M0                        479
#define CCP2M1                        480
#define CCP2M2                        481
#define CCP2M3                        482
#define DC2B0                         483
#define CCP2Y                         484
#define DC2B                          485
#define DC2B1                         486
#define CCP2X                         487
#define CCP1CON                       488
#define CCP1M0                        489
#define CCP1M                         490
#define CCP1M1                        491
#define CCP1M2                        492
#define CCP1M3                        493
#define CCP1Y                         494
#define DC1B                          495
#define DC1B0                         496
#define CCP1X                         497
#define DC1B1                         498
#define P1M                           499
#define P1M0                          500
#define P1M1                          501
#define ADCON2                        502
#define ADCS0                         503
#define ADCS                          504
#define ADCS1                         505
#define ADCS2                         506
#define ACQT0                         507
#define ACQT                          508
#define ACQT1                         509
#define ACQT2                         510
#define ADFM                          511
#define ADCON1                        512
#define PCFG0                         513
#define PCFG                          514
#define PCFG1                         515
#define PCFG2                         516
#define CHSN3                         517
#define PCFG3                         518
#define VCFG                          519
#define VCFG0                         520
#define VCFG01                        521
