tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf4221_tdd.h
#define VCFG11                        522
#define VCFG1                         523
#define ADCON0                        524
#define ADON                          525
#define nDONE                         526
#define GO_nDONE                      527
#define NOT_DONE                      528
#define GODONE                        529
#define GO_DONE                       530
#define DONE                          531
#define GO_NOT_DONE                   532
#define GO                            533
#define CHS                           534
#define CHS0                          535
#define CHS1                          536
#define CHS2                          537
#define CHS3                          538
#define SSPCON2                       539
#define SEN                           540
#define RSEN                          541
#define ADMSK1                        542
#define PEN                           543
#define ADMSK2                        544
#define RCEN                          545
#define ADMSK3                        546
#define ACKEN                         547
#define ADMSK4                        548
#define ADMSK5                        549
#define ACKDT                         550
#define ACKSTAT                       551
#define GCEN                          552
#define SSPCON1                       553
#define SSPM0                         554
#define SSPM                          555
#define SSPM1                         556
#define SSPM2                         557
#define SSPM3                         558
#define CKP                           559
#define SSPEN                         560
#define SSPOV                         561
#define WCOL                          562
#define SSPSTAT                       563
#define BF                            564
#define UA                            565
#define R_NOT_W                       566
#define NOT_W                         567
#define nW                            568
#define RW                            569
#define nWRITE                        570
#define R                             571
#define W                             572
#define NOT_WRITE                     573
#define R_nW                          574
#define R_W                           575
#define START                         576
#define S                             577
#define STOP                          578
#define P                             579
#define A                             580
#define NOT_A                         581
#define nA                            582
#define D_A                           583
#define D_nA                          584
#define D                             585
#define DA                            586
#define D_NOT_A                       587
#define NOT_ADDRESS                   588
#define nADDRESS                      589
#define CKE                           590
#define SMP                           591
#define T2CON                         592
#define T2CKPS0                       593
#define T2CKPS                        594
#define T2CKPS1                       595
#define TMR2ON                        596
#define T2OUTPS0                      597
#define TOUTPS0                       598
#define TOUTPS                        599
#define T2OUTPS1                      600
#define TOUTPS1                       601
#define T2OUTPS2                      602
#define TOUTPS2                       603
#define T2OUTPS3                      604
#define TOUTPS3                       605
#define PR2                           606
#define WM0                           607
#define WM1                           608
#define WAIT0                         609
#define WAIT1                         610
#define EBDIS                         611
#define T1CON                         612
#define TMR1ON                        613
#define TMR1CS                        614
#define NOT_T1SYNC                    615
#define T1SYNC                        616
#define nT1SYNC                       617
#define T1OSCEN                       618
#define SOSCEN                        619
#define T1CKPS0                       620
#define T1CKPS                        621
#define T1CKPS1                       622
#define T1RUN                         623
#define T1CON_RD16                    624
#define T1RD16                        625
#define RCON                          626
#define BOR                           627
#define NOT_BOR                       628
#define nBOR                          629
#define POR                           630
#define nPOR                          631
#define NOT_POR                       632
#define nPD                           633
#define NOT_PD                        634
#define PD                            635
#define NOT_TO                        636
#define nTO                           637
#define TO                            638
#define nRI                           639
#define NOT_RI                        640
#define RI                            641
#define SBOREN                        642
#define IPEN                          643
#define WDTCON                        644
#define SWDTE                         645
#define SWDTEN                        646
#define HLVDCON                       647
#define HLVDL                         648
#define HLVDL0                        649
#define LVV0                          650
#define LVDL0                         651
#define HLVDL1                        652
#define LVV1                          653
#define LVDL1                         654
#define HLVDL2                        655
#define LVV2                          656
#define LVDL2                         657
#define HLVDL3                        658
#define LVV3                          659
#define LVDL3                         660
#define HLVDEN                        661
#define LVDEN                         662
#define BGST                          663
#define IRVST                         664
#define VDIRMAG                       665
#define OSCCON                        666
#define SCS0                          667
#define SCS                           668
#define SCS1                          669
#define FLTS                          670
#define IOFS                          671
#define OSTS                          672
#define IRCF                          673
#define IRCF0                         674
#define IRCF1                         675
#define IRCF2                         676
#define IDLEN                         677
#define T0CON                         678
#define T0PS                          679
#define T0PS0                         680
#define T0PS1                         681
#define T0PS2                         682
#define PSA                           683
#define T0SE                          684
#define T0CS                          685
#define T08BIT                        686
#define T016BIT                       687
#define TMR0ON                        688
#define STATUS                        689
#define C                             690
#define CARRY                         691
#define DC                            692
#define ZERO                          693
#define Z                             694
#define OV                            695
#define OVERFLOW                      696
#define N                             697
#define NEGATIVE                      698
#define INTCON3                       699
#define INT1IF                        700
#define INT1F                         701
#define INT2IF                        702
#define INT2F                         703
#define INT1E                         704
#define INT1IE                        705
#define INT2IE                        706
#define INT2E                         707
#define INT1P                         708
#define INT1IP                        709
#define INT2IP                        710
#define INT2P                         711
#define INTCON2                       712
#define RBIP                          713
#define TMR0IP                        714
#define INTEDG2                       715
#define INTEDG1                       716
#define INTEDG0                       717
#define RBPU                          718
#define NOT_RBPU                      719
#define nRBPU                         720
#define INTCON                        721
#define RBIF                          722
#define INT0F                         723
#define INT0IF                        724
#define T0IF                          725
#define TMR0IF                        726
#define RBIE                          727
#define INT0E                         728
#define INT0IE                        729
#define T0IE                          730
#define TMR0IE                        731
#define PEIE                          732
#define PEIE_GIEL                     733
#define GIEL                          734
#define GIE_GIEH                      735
#define GIE                           736
#define GIEH                          737
#define SP0                           738
#define STKPTR                        739
#define SP1                           740
#define SP2                           741
#define SP3                           742
#define SP4                           743
#define STKUNF                        744
#define STKOVF                        745
#define STKFUL                        746

#endif // _PIC18LF4221_H_
